{"status":"success","totalResults":126,"results":[{"title":"Major US LNG Exporter May Extend Texas Plant Outage Through December","link":"https://financialpost.com/pmn/business-pmn/major-us-lng-exporter-may-extend-texas-plant-outage-through-december","keywords":["PMN Business","BLOOM","energy"],"creator":["Bloomberg News"],"video_url":null,"description":"(Bloomberg) -- A major US liquefied natural gas exporter will likely extend an outage that began in June, curbing much-needed supply to customers in Europe and Asia right before winter.","content":"Article content (Bloomberg) — A major US liquefied natural gas exporter will likely extend an outage that began in June, curbing much-needed supply to customers in Europe and Asia right before winter. Article content We apologize, but this video has failed to load. Try refreshing your browser, or tap here to see other videos from our team . Major US LNG Exporter May Extend Texas Plant Outage Through December Back to video Freeport LNG told buyers it will likely cancel shipments scheduled for November and December as work continues on repairs and regulatory approvals before a restart, according to people with knowledge of the matter. Article content The company’s LNG export facility in Freeport, Texas, which previously accounted for about 15% of US shipments of the fuel, was knocked offline following an explosion and fire. The fate of the plant has fixated gas traders ever since. US gas prices slumped Friday after speculation that repairs could take longer than expected. The closely held company later said that a tweet about cracks in pipes at its terminal contained false information. While global LNG prices are currently sliding amid a temporary glut ahead of the northern hemisphere winter, an extended outage could tighten the market once again and complicate Europe’s effort to replace Russian pipeline gas. And the longer the export plant remains offline, the more gas will be accumulated at home, weighing on domestic prices. Article content US gas futures partially erased earlier gains on the news. Gas for December delivery were 1.9% higher at $5.99 per million British thermal units as of 1:40 p.m. in New York, after surging as much as 9.1%. As recently as last week, Freeport said it was targeting a resumption of operations this month. But Freeport recently told customers that timeline has become challenging, according to the people, who asked not to be identified as they weren’t authorized to discuss the matter. Freeport LNG hasn’t been clear to clients about when exactly its facility will restart, they said. The company said it doesn’t comment on its customers’ communications. “Our work of progressing towards the restart of our liquefaction facility continues. That work includes obtaining the necessary regulatory approvals required for the restart of our facility,” Heather Browne, a Freeport LNG spokesperson, said by email Monday, without providing a timeline. Freeport still needs to submit its restart plan with the Pipeline and Hazardous Materials Safety Administration, a US regulator, before it can resume operations. The process may take at least one or two weeks to get authorization, according to energy analysis firm Wood Mackenzie Ltd., which estimates the plant won’t start until December. —With assistance from Gerson Freitas Jr.. (Updates with gas prices in fifth paragraph)","pubDate":"2022-11-14 18:54:34","image_url":null,"source_id":"financialpost","country":["canada"],"category":["top"],"language":"english"},{"title":"Appeals court ruling keeps Biden student debt plan on hold","link":"https://toronto.citynews.ca/2022/11/14/appeals-court-ruling-keeps-biden-student-debt-plan-on-hold/","keywords":["World"],"creator":["News Staff"],"video_url":null,"description":"President Joe Biden’s plan to forgive student loan debt for millions of borrowers lost another battle in court on Monday when a federal appeals court panel agreed to a preliminary injunction halting the program while an appeal plays out. The ruling by the three-judge panel from the 8th U.S. Circuit Court of Appeals in St. […]","content":"President Joe Biden’s plan to forgive student loan debt for millions of borrowers lost another battle in court on Monday when a federal appeals court panel agreed to a preliminary injunction halting the program while an appeal plays out. The ruling by the three-judge panel from the 8th U.S. Circuit Court of Appeals in St. Louis came days after a federal judge in Texas blocked the program, saying it usurped Congress’ power to make laws. The Texas case was appealed and the administration is likely to appeal the 8th Circuit ruling as well. The debt forgiveness plan would cancel $10,000 in student loan debt for those making less than $125,000 or households with less than $250,000 in income. Pell Grant recipients, who typically demonstrate more financial need, would get an additional $10,000 in debt forgiven. The cancellation applies to federal student loans used to attend undergraduate and graduate school, along with Parent Plus loans. A federal judge on Oct. 20 allowed the program to proceed. But the 8th Circuit temporarily put the forgiveness plan on hold Oct. 21 while it considered an effort by the states of Nebraska, Missouri, Iowa, Kansas, Arkansas and South Carolina to block the program. The new ruling from the panel made up of three Republican appointees — one was appointed by President George W. Bush and two were appointed by President Donald Trump — extends the hold until the issue is resolved in court. Jim Salter, The Associated Press","pubDate":"2022-11-14 18:43:21","image_url":"https://toronto.citynews.ca/wp-content/themes/samuel/images/covid-19_placeholder_2.png","source_id":"toronto_citynews","country":["canada"],"category":["top"],"language":"english"},{"title":"Deriv Appoints Alexandros Patsalides as Head of Institutional Dept.","link":"https://www.financemagnates.com//executives/deriv-appoints-alexandros-patsalides-as-head-of-institutional-dept/","keywords":["Executive Moves","Executives"],"creator":["Solomon Oladipupo","www.financemagnates.com"],"video_url":null,"description":"<p class=\"MsoNormal\">Deriv, an online trading services provider, has appointed Alexandros Patsalides, the Director of the Financial Services Division at EBO.ai, a virtual agent provider, as its new Head of the Institutional Department. </p><p class=\"MsoNormal\">Patsalides announced his appointment by <a href=\"https://www.financemagnates.com/tag/deriv/\">Deriv</a> on Monday on LinkedIn. The executive, who describes himself as a technology and business strategist, has over 18 years of experience working within the IT industry in Cyprus including in managerial and commercial roles. During the course of his career, Patsalides has worked for top organizations such as <a href=\"https://www.financemagnates.com/tag/tools-for-brokers/\">Tools for Brokers</a> and IBM. </p><p class=\"MsoNormal\">He also has a deep background working in an academic setting. Patsalides has been working with the P.A. College, a Cyprus-based executive business school, for over a decade. He served first as a Non-Executive Chief Information Officer (CIO) for over seven years between March 2012 and September 2019, and later as executive CIO for over three years now. </p><p class=\"MsoNormal\">More on Patsalides’ Career</p><p class=\"MsoNormal\">Between May 2020 and August 2021, Patsalides was the Sales Manager for the Europe, Middle East, India and Africa (EMEIA) region at Tools for Brokers. Before then, he spent three-month stints as a Global Director of Business Development, first in Texas, United States, at Soffos.ai, a Texas-based low-code AI solutions provider, and later in Cyprus at Fountech.ai, another AI-based solutions provider. </p><p class=\"MsoNormal\">For four months in 2019, Patsalides worked in the United Kingdom at Prospex, an AI-based company. He was also the VP of operations and Technology at Dynatrak Holding Limited between November 2017 and September 2019. </p><p class=\"MsoNormal\">Furthermore, the executive worked as a Country Software Group Sales Manager at IBM and helped the company to win new license sales revenue and also developed strategies and plans to address the public and private sectors in Cyprus. </p><p class=\"MsoNormal\">Before IBM, he worked at Hellenic Technical Enterprises Limited between November 2006 and October 2008. At the firm, Patsalides “was headhunted by the top management of one of Cyprus’ premier IT solution vendors to be the Senior Strategic Solutions Architect of the company.” </p><p class=\"MsoNormal\">Meanwhile, Deriv <a href=\"https://www.financemagnates.com/forex/deriv-group-launches-new-cfd-white-label-deriv-x/\">recently launched</a> a new contract for difference (CFD) white label trading platform, Deriv X. Finance Magnates reports that Deriv X was developed in partnership with Devexperts, a software provider that specializes in trading and investment software development.</p> This article was written by Solomon Oladipupo at www.financemagnates.com.","content":"Deriv, an online trading services provider, has appointed Alexandros Patsalides, the Director of the Financial Services Division at EBO.ai, a virtual agent provider, as its new Head of the Institutional Department. Patsalides announced his appointment by on Monday on LinkedIn. The executive, who describes himself as a technology and business strategist, has over 18 years of experience working within the IT industry in Cyprus including in managerial and commercial roles. During the course of his career, Patsalides has worked for top organizations such as and IBM. He also has a deep background working in an academic setting. Patsalides has been working with the P.A. College, a Cyprus-based executive business school, for over a decade. He served first as a Non-Executive Chief Information Officer (CIO) for over seven years between March 2012 and September 2019, and later as executive CIO for over three years now. Between May 2020 and August 2021, Patsalides was the Sales Manager for the Europe, Middle East, India and Africa (EMEIA) region at Tools for Brokers. Before then, he spent three-month stints as a Global Director of Business Development, first in Texas, United States, at Soffos.ai, a Texas-based low-code AI solutions provider, and later in Cyprus at Fountech.ai, another AI-based solutions provider. For four months in 2019, Patsalides worked in the United Kingdom at Prospex, an AI-based company. He was also the VP of operations and Technology at Dynatrak Holding Limited between November 2017 and September 2019. Furthermore, the executive worked as a Country Software Group Sales Manager at IBM and helped the company to win new license sales revenue and also developed strategies and plans to address the public and private sectors in Cyprus. Before IBM, he worked at Hellenic Technical Enterprises Limited between November 2006 and October 2008. At the firm, Patsalides “was headhunted by the top management of one of Cyprus’ premier IT solution vendors to be the Senior Strategic Solutions Architect of the company.” Meanwhile, Deriv a new contract for difference (CFD) white label trading platform, Deriv X. reports that Deriv X was developed in partnership with Devexperts, a software provider that specializes in trading and investment software development.","pubDate":"2022-11-14 18:30:52","image_url":null,"source_id":"financemagnates","country":["united states of america"],"category":["top"],"language":"english"},{"title":"Misfits Boxing 3 fight card and live stream guide: Hasim Rahman Jr vs Vitor Belfort headlines, Fangs vs 6ar6ie6 on show","link":"https://www.thescottishsun.co.uk/sport/9764722/misfits-boxing-3-fight-card-live-stream-hasim-rahman-jr-vs-vitor-belfort/","keywords":["Boxing","Sport","DAZN","Explainers"],"creator":["James Orr"],"video_url":null,"description":null,"content":"BOXER Hasim Rahman Jr faces MMA legend in a HUGE bout to headline the Misfits Boxing 3 card in Texas this weekend. The fight was originally set for October but now tops the massive show in Austin instead. 2 How the big card is shaping up Second generation star Rahman Jr, 31, has a pro record of 12-1, and was set to face Jake Paul earlier this year in September. A dispute over the weight for the fight meant it was called off at late notice. While Brazilian MMA star Belfort, 45, beat Evander Holyfield inside one round in a big exhibition bout last year. YouTube sensations King Kenny and Deen the Great are also on a STACED bill in the US. Read more boxing PUNCH IT IN YOUR DIARY Boxing schedule 2022: Upcoming fights including Fury vs Chisora MAY PAY DAY Mayweather's boxing career was worth $2.7BILLION as earnings from PPVs revealed When is Misfits Boxing 3? Misfits Boxing 3 takes place on Saturday, November 19. The Moody Center in Austin, Texas, plays host. What live stream and TV channel is Misfits Boxing 3 on? Misfits Boxing 3 will be broadcast live on DAZN. DAZN costs £7.99 per month for subscribers. 2 Vitor Belfort battered Evander Holyfield last year What is the Misfits Boxing 3 fight card? Hasim Rahman Jr vs Vitor Belfort Josh Brueckner vs Chase DeMoor King Kenny vs DK Money Deen The Great vs Walid Sharks Minikon vs Nick Joseph Fangs vs 6ar6ie6 Brandon Buckingham vs Ice Poseidon Most read in Boxing MAYWEATHER VS DEJI Latest from Dubai as big fight ends in CONTROVERSIAL stoppage FURYOUS Jake Paul taunts John Fury for looking like Shrek as Tommy's dad rips off shirt THEY THINK IT'S PAUL OVER Fury booed during fight and savaged by commentator Jake Paul FURY VS LAMBERT TOPLESS John Fury calls out Jake Paul after son's shocking bout in Dubai","pubDate":"2022-11-14 18:24:01","image_url":null,"source_id":"thescottishsun","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Ted Cruz goes off on McConnell: 'Insane if we re-elect the same leadership'","link":"https://www.rawstory.com/ted-cruz-mitch-mcconnell/","keywords":null,"creator":["Travis Gettys"],"video_url":null,"description":"Sen. Ted Cruz (R-TX) appears ready to shake up Republican leadership after last week's midterm elections failed to produce a Senate majority.The Texas Republican, whose own crop of candidates flopped in last Tuesday's vote, has called for leadership elections to be postponed until after the Dec. 6 runoff election in Georgia, where Republicans remain hopeful that Herschel Walker will hold the Democratic majority at 50-50, with vice president Kamala Harris casting the tie-breaking vote.“I am so pissed off I cannot even see straight,\" Cruz said Monday on his podcast. \"This opportunity was screwed up, it was screwed up badly.”IN OTHER NEWS: Lauren Boebert's slight lead could diminish if ballots tossed due to signature verification are fixed: reportCruz signaled that Senate minority leader Mitch McConnell could lose his position in the aftermath.“Everybody bears some of the blame,” Cruz said, \"[but it would be] insane if we re-elect the same leadership two days from now.” \\u201c.@TedCruz on midterms: \\u201cI am so pissed off I cannot even see straight. \\u2026 This opportunity was screwed-up, it was screwed-up badly.\\u201d\\n\\n\\u201cEverybody bears some of the blame,\\u201d but in Senate, it\\u2019d be \\u201cinsane if we reelect the same leadership two days from now.\\u201d\\n\\nhttps://t.co/ORqVSACtEN\\u201d — Patrick Svitek (@Patrick Svitek) 1668439765","content":"Sen. Ted Cruz (R-TX) appears ready to shake up Republican leadership after last week's midterm elections failed to produce a Senate majority. The Texas Republican, whose own crop of candidates flopped in last Tuesday's vote, has called for leadership elections to be postponed until after the Dec. 6 runoff election in Georgia, where Republicans remain hopeful that Herschel Walker will hold the Democratic majority at 50-50, with vice president Kamala Harris casting the tie-breaking vote. “I am so pissed off I cannot even see straight,\" Cruz said Monday on his podcast. \"This opportunity was screwed up, it was screwed up badly.” IN OTHER NEWS: Lauren Boebert's slight lead could diminish if ballots tossed due to signature verification are fixed: report Cruz signaled that Senate minority leader Mitch McConnell could lose his position in the aftermath. “Everybody bears some of the blame,” Cruz said, \"[but it would be] insane if we re-elect the same leadership two days from now.” \\u201c.@TedCruz on midterms: \\u201cI am so pissed off I cannot even see straight. \\u2026 This opportunity was screwed-up, it was screwed-up badly.\\u201d\\n\\n\\u201cEverybody bears some of the blame,\\u201d but in Senate, it\\u2019d be \\u201cinsane if we reelect the same leadership two days from now.\\u201d\\n\\nhttps://t.co/ORqVSACtEN\\u201d — Patrick Svitek (@Patrick Svitek) 1668439765 Trump-backed Georgia Senate candidate Herschel Walker on Monday slammed attempts to transition Americans over to electric cars during a speech where he heaped praise on \"gas guzzling\" vehicles. Walker, who faces a runoff election next month against incumbent Sen. Raphael Warnock (D-GA), told a crowd of supporters that projections about the United States being able to move to green energy are unrealistic. \"Now let me tell you this here: If we was ready for the green agenda, I'd raise my hand right now,\" he said. \"But we're not ready right now! So don't let them fool you like this is a new agenda, this is not a new agenda! We're not prepared, we're not ready right now! What we need to do is keep having these gas-guzzling cars, because we got the good emissions under those cars. We're doing the best thing that we can!\" This is not the first time that Walker has spoken confusingly about energy and environmental policy. READ MORE: Trump claims classified documents automatically became his property by taking them to Mar-a-Lago Earlier this year, for example, Walker seemed to suggest that China was taking America's \"good air\" and replacing it with \"bad air.\" \"Since we don't control the air, our good air decided to float over to China's bad air, so when China gets our good air, their bad air got to move,\" Walker said. \"So it moves over to our good air space. Then, now, we got we to clean that back up.\" Watch the video below or at this link . \\u201cGeorgia Senate candidate Herschel Walker (R): \"If we was ready for the green agenda, I'd raise my hand right now. But we're not ready right now ... What we need to do is keep having those gas-guzzling cars, 'cause we got the good emissions under those cars.\"\\u201d — The Recount (@The Recount) 1668449021 CONTINUE READING Show less U.S. Attorney Merrick Garland was asked to investigate former President Donald Trump's claim that he sent the Federal Bureau of Investigations (FBI) agents to ensure that Ron DeSantis (R) won his race for governor in 2018. In messages posted to social media last week, Trump labeled the Florida governor as \"DeSanctimonious.\" And he also claimed that he had sent the FBI to assist DeSantis during the 2018 campaign against Democrat Andrew Gillum. \"I also fixed his campaign, which had completely fallen apart,\" Trump wrote. \"I was all in for Ron, and he beat Gillum, but after the race, when votes were being stolen by the corrupt Election process in Broward County, and Ron was going down ten thousand votes a day, along with now-Senator Rick Scott, I sent in the FBI and the U.S. Attorneys, and the ballot theft immediately ended, just prior to them running out of the votes necessary to win. I stopped his Election from being stolen.\" On Monday, Florida Commissioner of Agriculture and Consumer Services Nikki Fried, a member of DeSantis' cabinet, shared a letter asking Garland to investigate the matter. \"It is imperative you address these allegations immediately,\" Fried told Garland. \"There was no widespread election fraud in the 2018 Election in Florida. There was no broad allegation that the election was being stolen from Ron DeSantis in favor of Andrew Gillum. I know because I was on the ballot in 2018.\" In a statement , Fried said Garland must ensure that Trump's administration did not \"tamper\" with Florida ballots. \"If the President was tampering with state ballots, we need to know,\" the statement said. \"If he is fabricating these allegations in the name of politics, we also need to know. Either way, these actions hurt our democracy and Floridians deserve to know their elections are operating with integrity.\" In a message on Twitter, Justice Department spokesperson Sarah Isgur said that the FBI's involvement in the Florida election \"never happened.\" CONTINUE READING Show less A defining characteristic of cancer cells is their immortality . Usually, normal cells are limited in the number of times they can divide before they stop growing. Cancer cells, however, can overcome this limitation to form tumors and bypass “mortality” by continuing to replicate. Telomeres play an essential role in determining how many times a cell can divide. These repetitive sequences of DNA are located at the ends of chromosomes, structures that contain genetic information. In normal cells, continued rounds of replication shorten telomeres until they become so short that they eventually trigger the cell to stop replicating. In contrast, tumor cells can maintain the lengths of their telomeres by activating an enzyme called telomerase that rebuilds telomeres during each replication. Telomeres are protective caps at the ends of chromosomes. FancyTapis/iStock via Getty Images Plus Telomerase is encoded by a gene called TERT , one of the most frequently mutated genes in cancer. TERT mutations cause cells to make a little too much telomerase and are thought to help cancer cells keep their telomeres long even though they replicate at high rates. Melanoma , an aggressive form of skin cancer, is highly dependent on telomerase to grow, and three-quarters of all melanomas acquire mutations in telomerase. These same TERT mutations also occur across other cancer types . Unexpectedly, researchers found that TERT mutations could only partially explain the longevity of telomeres in melanoma. While TERT mutations did indeed extend the life span of cells, they did not make them immortal. That meant there must be something else that helps telomerase allow cells to grow uncontrollably. But what that “second hit” might be has been unclear. We are researchers who study the role telomeres play in human health and diseases like cancer in the Alder Lab at the University of Pittsburgh. While investigating the ways that tumors maintain their telomeres, we and our colleagues found another piece to the puzzle: another telomere-associated gene in melanoma. Cancer is a result of uncontrollable cell growth. Cell immortality gets a boost Our team focused on melanoma because this type of cancer is linked to people with long telomeres . We examined DNA sequencing data from hundreds of melanomas, looking for mutations in genes related to telomere length. We identified a cluster of mutations in a gene called TPP1 . This gene codes for one of the six proteins that form a molecular complex called shelterin that coats and protects telomeres. Even more interesting is the fact that TPP1 is known to activate telomerase . Identifying the TPP1 gene’s connection to cancer telomeres was, in a way, obvious. After all, it was more than a decade ago that researchers showed that TPP1 would increase telomerase activity. We tested whether having an excess of TPP1 could make cells immortal. When we introduced just TPP1 proteins into cells, there was no change in cell mortality or telomere length. But when we introduced TERT and TPP1 proteins at the same time, we found that they worked synergistically to cause significant telomere lengthening. To confirm our hypothesis, we then inserted TPP1 mutations into melanoma cells using CRISPR-Cas9 genome editing. We saw an increase in the amount of TPP1 protein the cells made, and a subsequent increase in telomerase activity. Finally, we returned to the DNA sequencing data and found that 5% of all melanomas have a mutation in both TERT and TPP1. While this is still a significant proportion of melanomas, there are likely other factors that contribute to telomere maintenance in this cancer. Our findings imply that TPP1 is likely one of the missing puzzle pieces that boost telomerase’s capacity to maintain telomeres and support tumor growth and immortality. Making cancer mortal Knowing that cancer use these genes in their replication and growth means that researchers could also block them and potentially stop telomeres from lengthening and make cancer cells mortal. This discovery not only gives scientists another potential avenue for cancer treatment, but also draws attention to an underappreciated class of mutations outside the traditional boundaries of genes that can play a role in cancer diagnostics. Pattra Chun-On , Ph.D. Candidate in Environmental and Occupational Health, University of Pittsburgh Health Sciences and Jonathan Alder , Assistant Professor of Medicine, University of Pittsburgh Health Sciences This article is republished from The Conversation under a Creative Commons license. Read the original article . CONTINUE READING Show less","pubDate":"2022-11-14 18:03:21","image_url":"https://www.rawstory.com/media-library/senator-ted-cruz.jpg?id=29862120&width=980","source_id":"rawstory","country":["united kingdom"],"category":["top"],"language":"english"},{"title":"What we know so far about the victims in the Dallas air show plane collision","link":"https://www.thetimesofbengal.com/international/what-we-know-so-far-about-the-victims-in-the-dallas-air-show-plane-collision/","keywords":["International"],"creator":["admin"],"video_url":null,"description":"All six people who died in Saturday’s midair collision of two vintage aircraft at the Wings Over Dallas Airshow have been identified. Terry Barker, Craig Hutain, Kevin Michels, Dan Ragan, Leonard Root and Curt Rowe were all members of the Commemorative Air Force, a Texas nonprofit “dedicated to flying and restoring World War II aircraft” […]","content":"All six people who died in Saturday’s midair collision of two vintage aircraft at the Wings Over Dallas Airshow have been identified. Terry Barker, Craig Hutain, Kevin Michels, Dan Ragan, Leonard Root and Curt Rowe were all members of the Commemorative Air Force, a Texas nonprofit “dedicated to flying and restoring World War II aircraft” and the host of the Wings Over Dallas Airshow, according to their website. “We are heartbroken to announce that the following members of the Commemorative Air Force went west on Saturday, November 12, 2022, at the Wings Over Dallas WWII Airshow while performing,” the nonprofit said in a statement. “Please join us in mourning the loss of our good friends and fellow airmen.” The crash occurred around 1:20 p.m. Saturday, when the Boeing B-17 Flying Fortress and a Bell P-63 Kingcobra collided at the Wings Over Dallas Airshow at Dallas Executive Airport, according to information provided by the Federal Aviation Administration. The Commemorative Air Force did not specify which men were on board the Flying Fortress and which were on the Kingcobra during the collision. Curt Rowe Curt Rowe.Commemorative Air Force / via Facebook Major Curtis J. Rowe served for more than 30 years on the Ohio Wing Civil Air Patrol and “volunteered as a crew member on a vintage Boeing B–17 Flying Fortress for the Commemorative Air Force where he shared his passion for flying,” according to a statement from the service. “Curt touched the lives of thousands of his fellow Civil Air Patrol members, especially when flying cadets during hundreds of orientation flights over the course of his service,” said Peter K. Bowden, Commander of the Ohio Wing Civil Air Patrol. During his time with the Civil Air Patrol, Rowe “served in positions ranging from Safety Officer to Operations Officer at the squadron and wing levels, with his most current position being Ohio Wing Maintenance Officer.” The 64-year-old Hillard, Ohio, man loved flying and teaching others about it, according to his family, NBC affiliate WCMH reported.“There’s not very many like him around,” his cousin, Tom Rowe, told the outlet. “He loved his family. He had great pride in his country and in serving his country.” Terry Barker Terry Barker.Commemorative Air Force / via Facebook Terry Barker was an army veteran and a former city councilman in Keller, Texas, according to Keller Mayor Armin Mizani. “Terry Barker was beloved by many,” Mizani wrote in a Facebook post along with pictures of Barker. “He was a friend and someone whose guidance I often sought. Even after retiring from serving on the City Council and flying for American Airlines, his love for community was unmistakable.” The Allied Pilots Association, the American Airlines pilots union, identified Barker as one of the crew members lost on the B-17 Flying Fortress. Barker served on the city council from 1999 to 2003 and was an experienced pilot who just retired, according to NBC Dallas-Forth Worth. “He was a pilot for American Airlines. He was a captain. He just recently retired in 2020. But he was with American Airlines for 36 years,” Mizani told the outlet. He leaves behind his wife, two sons and a new grandchild, reports NBC Dallas-Forth Worth. “Yesterday he was flying to honor the greatest generation. Today, the Field of Honor in front of Keller Town Hall will remain standing an additional week in his honor,” said Mizani. This is a developing story. Please check back for updates. Mirna Alsharif is a breaking news reporter for NBC News. Jason Cumming Jason Cumming is London editorial manager and a senior news editor for NBC News Digital. Source link","pubDate":"2022-11-14 17:34:56","image_url":null,"source_id":"the_tob","country":["india"],"category":["top"],"language":"english"},{"title":"Boy George’s best mate sends ‘warning’ to music icon after camp meltdown","link":"https://www.thescottishsun.co.uk/tv/9764384/boy-georges-best-mate-warning-music-icon-camp-meltdown/","keywords":["I’m A Celebrity","TV","I'm a Celebrity... Get Me Out of Here"],"creator":["Emily Hirst"],"video_url":null,"description":null,"content":"MUSIC icon Boy George was sent a warning via social media from close friend. The culture club singer has been given some stark words of wisdom for the I'm A Celebrity...Get Me Out Of Here! jungle, from his best friend. 3 Boy George on I’m a Celebrity… Get Me Out of Here! series 22 Credit: Rex 3 Boy George's friend sent a warning to the star after camp meltdown Credit: ITV/Instagram Posting to social media, George's close friend who is dubbed 'PK', offered some words of advice, stating: \"Are you all watching ? If I could get to him now I’d say get out ya head George … give us that smile it will light the country up !!! PK\" The post, that featured a snap of the star in camp, raked in over 17,000 likes, with fans flocking to the comments to share their thoughts. One wrote: \"He's driving me mad with his hypocrisy!!\". Another fan wrote: \"Keep giving it to Hancock!! You're my winner!! ❤️\". More on Boy George OH BOY Richard Madeley slams I’m A Celeb stars for not grilling Boy George on prison past 'THEY WILL CLASH' Boy George’s pal reveals his pet hates & it’s bad news for Matt Hancock Some viewers ranted in the comments of the post, frustrated with the star's recent antics. One wrote: \"He acting like a child sorry\". A second added: \"Boy George is the most boring person in the jungle\". Praising the musician, another commented: \"Only watching because George is in,I love his honesty #georgeforjungleking\". Most read in I’m A Celebrity idle campers I'm A Celeb fans blast '3 lazy stars' & say camp gossips are 'stirring feud' JUNGLE RUMBLE IAC fans ‘work out’ who will be first out after spotting ‘clues’ JUNGLE ODDS Which star is favourite to be crowned winner of I'm A Celebrity? GRUMBLE IN THE JUNGLE Olivia Attwood hints at I'm A Celeb 'cover-up' & gives health update The star has raised eyebrows with his recent antics on the show, most notably clashing with disgraced former health secretary Matt Hancock. Chatting on Good Morning Britain to promote his new book The Boy Who Sat By The Window , author Davide Hodge explained Boy George’s dislike for Hancock, stating \"There will be friction. \"There's two things that George doesn't particularly like and that's bigots and Tories. \"There will be a clash because I know how he feels about those issues.\" The star recently avoided Matt whilst his fellow campmates laid into the politician regarding his questionable behaviour, including snogging an aide and breaking lockdown rules during the pandemic. A show source said: “George walked away just before things started getting heated. \"He would’ve flipped his lid if he was sitting there listening to Matt’s frankly pathetic excuses.” 3 Boy George and Culture Club performed during Austin City Limits Music Festival at Austin, Texas in October Credit: AFP","pubDate":"2022-11-14 17:01:16","image_url":null,"source_id":"thescottishsun","country":["united kingdom"],"category":["entertainment"],"language":"english"},{"title":"NTSB Launches Investigation Into Dallas Air Show Collision","link":"https://www.couriermail.com.au/news/national/ntsb-launches-investigation-into-dallas-air-show-collision/video/2e15ef2634ffb23370ddb6d8a9e94fb1","keywords":["National"],"creator":null,"video_url":null,"description":"The National Transportation Safety Board (NTSB) said it began conducting an investigation into the mid-air collision of two historic war planes which occurred during an airshow in Dallas, Texas, on Saturday, November 12. The collision happened at the Wings Over Dallas WWII Airsho​w ​at the Dallas Executive Airport Terminal, killing five crew members of one plane and the pilot of the other. At an NTSB media briefing on November 13, board member Michael Graham said an investigation has been launched, and a preliminary report of the accident is expected in four to six weeks. “Neither aircraft was equipped with a flight data recorder or a cockpit voice recorder, often known as the black box,” Graham said. Given the lack of flight data records, Graham said that videos of the incident from witnesses will be “very critical.” Footage released by the NTSB shows debris from the plane crash and scorch marks on the ground. Credit: National Transportation Safety Board via Storyful","content":"The National Transportation Safety Board (NTSB) said it began conducting an investigation into the mid-air collision of two historic war planes which occurred during an airshow in Dallas, Texas, on Saturday, November 12. The collision happened at the Wings Over Dallas WWII Airsho​w ​at the Dallas Executive Airport Terminal, killing five crew members of one plane and the pilot of the other. At an NTSB media briefing on November 13, board member Michael Graham said an investigation has been launched, and a preliminary report of the accident is expected in four to six weeks. “Neither aircraft was equipped with a flight data recorder or a cockpit voice recorder, often known as the black box,” Graham said. Given the lack of flight data records, Graham said that videos of the incident from witnesses will be “very critical.” Footage released by the NTSB shows debris from the plane crash and scorch marks on the ground. Credit: National Transportation Safety Board via Storyful","pubDate":"2022-11-14 17:01:06","image_url":null,"source_id":"couriermail","country":["australia"],"category":["top"],"language":"english"},{"title":"Dallas air show victims named; NTSB investigation underway","link":"https://toronto.citynews.ca/2022/11/14/dallas-air-show-victims-named-ntsb-investigation-underway/","keywords":["World"],"creator":["News Staff"],"video_url":null,"description":"DALLAS (AP) — Officials have released the names of the six people killed in a deadly collision between two vintage military aircraft at a Dallas air show. The Commemorative Air Force, which put on the show, on Monday identified the victims as: Terry Barker, Craig Hutain, Kevin “K5” Michels, Dan Ragan, Leonard “Len” Root, and […]","content":"DALLAS (AP) — Officials have released the names of the six people killed in a deadly collision between two vintage military aircraft at a Dallas air show. The Commemorative Air Force, which put on the show, on Monday identified the victims as: Terry Barker, Craig Hutain, Kevin “K5” Michels, Dan Ragan, Leonard “Len” Root, and Curt Rowe. They died Saturday when a World War II-era bomber and a fighter plane collided and crashed in a ball of flames, horrifying spectators who had gathered for the air show, which opened on Veterans’ Day. Several videos posted on social media show the fighter plane flying into the bomber. Armin Mizani, the mayor of Keller, Texas, said Barker was a retired pilot who lived in Keller, a town of 50,000, where many of the residents know each other. “It’s definitely a big loss in our community,” he said. “We’re grieving.” Barker was an Army veteran who flew helicopters during his military service. He later worked for American Airlines for 36 years before retiring in 2020, Mizani said. Rowe, a member of the Ohio Wing Civil Air Patrol, was a crew chief on the B-17, his brother-in-law Andy Keller told The Associated Press on Sunday. Rowe, of Hilliard, Ohio, did air shows several times a year because he fell in love with WWII aircraft, Keller said. The National Transportation Safety Board is investigating the collision, including why both aircraft were flying at the same altitude and in the same air space, NTSB member Michael Graham said at a Sunday news conference. The crash came three years after the crash of a bomber in Connecticut that killed seven, and amid ongoing concern about the safety of air shows involving older warplanes. The company that owned the planes flying in the Wings Over Dallas show has had other crashes in its more than 60-year history. Investigators will examine the wreckage from both aircraft, conduct interviews of crews present at the air show and obtain pilot training and aircraft maintenance records. “We’ll look at everything that we can and we’ll let the evidence basically lead us to the appropriate conclusions. At this point, we will not speculate” on the cause, Graham said. A preliminary report from the NTSB is expected in four to six weeks, while a final report will take up to 18 months to complete. The B-17, a cornerstone of U.S. air power during World War II, is an immense four-engine bomber that was used in daylight raids against Germany. The Kingcobra, a U.S. fighter plane, was used mostly by Soviet forces during the war. Most B-17s were scrapped at the end of World War II and only a handful remain today, largely featured at museums and air shows, according to Boeing. Associated Press, The Associated Press","pubDate":"2022-11-14 16:01:39","image_url":"https://toronto.citynews.ca/wp-content/blogs.dir/sites/10/2022/11/20221113191132-63718d50821cf083b8220804jpeg.jpg","source_id":"toronto_citynews","country":["canada"],"category":["world"],"language":"english"},{"title":"CrowdStrike Named a Winner for 2022 CRN Tech Innovator Award for Best Cloud Security","link":"https://www.headlinesoftoday.com/topic/press-releases/crowdstrike-named-a-winner-for-2022-crn-tech-innovator-award-for-best-cloud-security.html","keywords":["Press-Releases"],"creator":["Business Wire"],"video_url":null,"description":"AUSTIN, Texas–(BUSINESS WIRE)–CrowdStrike (Nasdaq: CRWD), a leader in cloud-delivered protection of endpoints, cloud workloads, identity and data, today announced that CRN®, a brand of The Channel Company, has chosen CrowdStrike as a Winner for the 2022 CRN Tech Innovator Awards. CrowdStrike is being recognized for Best Cloud Security with CrowdStrike Cloud Security, its Cloud Native […]","content":"AUSTIN, Texas–(BUSINESS WIRE)–CrowdStrike (Nasdaq: CRWD), a leader in cloud-delivered protection of endpoints, cloud workloads, identity and data, today announced that CRN®, a brand of The Channel Company, has chosen CrowdStrike as a Winner for the 2022 CRN Tech Innovator Awards. CrowdStrike is being recognized for Best Cloud Security with CrowdStrike Cloud Security, its Cloud Native Application Protection Platform (CNAPP) solution. CrowdStrike’s adversary-focused approach to CNAPP provides both agent-based and agentless solutions delivered from the CrowdStrike Falcon platform. This gives organizations the flexibility needed to determine how best to eliminate security risks and ensure compliance at scale across the application development lifecycle in the cloud. CrowdStrike’s CNAPP capabilities optimize cloud deployments by providing complete visibility, shift left security, continuous breach prevention and industry-leading threat intelligence. “With CNAPP, we believe you need both agent-based and agentless solutions to protect cloud infrastructure. CrowdStrike allows you to detect and block attacks in real time with world-class threat intelligence and comprehensive visibility into risks across your cloud environments, as well as achieve cloud compliance,” said Michael Sentonas, chief technology officer at CrowdStrike. “Other vendors tout agentless CNAPP solutions that claim to deliver visibility and prioritization of threats in cloud environments. In reality, their technology is limited to a single snapshot each time you conduct a scan for threats. It’s not real time, and they can’t remediate threats – they’re simply detecting them. With CrowdStrike, organizations can get end-to-end protection from the host to the cloud, delivering greater visibility, compliance and threat intelligence to outsmart the adversary and stop breaches.” “Our CRN Tech Innovator Awards recognize those technology vendors that are making the biggest impacts in digital transformation for solutions providers with unique, cutting-edge products and services,” said Blaine Raddon, CEO of The Channel Company. “It is my pleasure to congratulate each and every one of our 2022 CRN Tech Innovator Award winners. We’re delighted to recognize these best-in-class vendors that are driving transformation and innovation in the IT space.” The Tech Innovator Awards will be featured in the December issue of CRN and can be viewed online at crn.com/techinnovators. Additional Resources To learn more about CrowdStrike Cloud Security, please visit the website. About CrowdStrike CrowdStrike (Nasdaq: CRWD), a global cybersecurity leader, has redefined modern security with one of the world’s most advanced cloud-native platforms for protecting critical areas of enterprise risk – endpoints and cloud workloads, identity and data. Powered by the CrowdStrike Security Cloud and world-class AI, the CrowdStrike Falcon® platform leverages real-time indicators of attack, threat intelligence, evolving adversary tradecraft and enriched telemetry from across the enterprise to deliver hyper-accurate detections, automated protection and remediation, elite threat hunting and prioritized observability of vulnerabilities. Purpose-built in the cloud with a single lightweight-agent architecture, the Falcon platform delivers rapid and scalable deployment, superior protection and performance, reduced complexity and immediate time-to-value. CrowdStrike: We stop breaches. Learn more: https://www.crowdstrike.com/ Follow us: Blog | Twitter | LinkedIn | Facebook | Instagram Start a free trial today: https://www.crowdstrike.com/free-trial-guide/ © 2022 CrowdStrike, Inc. All rights reserved. CrowdStrike, the falcon logo, CrowdStrike Falcon and CrowdStrike Threat Graph are marks owned by CrowdStrike, Inc. and registered with the United States Patent and Trademark Office, and in other countries. CrowdStrike owns other trademarks and service marks, and may use the brands of third parties to identify their products and services. Source link The content is by Business Wire. Headlines of Today Media is not responsible for the content provided or any links related to this content. Headlines of Today Media is not responsible for the correctness, topicality or the quality of the content.","pubDate":"2022-11-14 15:36:55","image_url":null,"source_id":"headlinesoftoday","country":["india"],"category":["top"],"language":"english"}],"nextPage":1}
